[A_PrimeMagic_Skill H7Skill]
mName="Изначальная магия"
mTooltip="Позволяет изучать в гильдии магов заклинания изначальной магии, а также усиливать их и добавлять дополнительные эффекты."
mDescriptions[2]="Увеличивает эффективность заклинаний изначальной магии и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 1."
mDescriptions[3]="Увеличивает эффективность заклинаний изначальной магии и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 2."
mDescriptions[4]="Увеличивает эффективность заклинаний изначальной магии и дополнительно повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний на 3."
mDescriptions[0]="Увеличивает эффективность заклинаний изначальной магии и повышает уровень %ICON_ARCANE_KNOWLEDGE магических знаний."
[A_PrimeScholar_Ability H7HeroAbility]
mName="Искусный маг изначального"
mTooltip="-%special.norm% к расходу маны на заклинания изначальной магии."
[A_ArcaneExaltation_Ability H7HeroAbility]
mName="Величие магии"
mTooltip="%stat2 к %stat2.icon магии.\n%stat1 к %stat1.icon духу."
[A_MasterOfPrime_I_Ability H7HeroAbility]
mName="Знание изнач. магии I"
mTooltip="%spell1.name и %spell2.name: теперь эти заклинания можно накладывать на отряды в выбранной области 4x4."
[A_MasterOfPrime_III_Ability H7HeroAbility]
mName="Знание изнач. магии III"
mTooltip="%spell1.name: теперь заклинание повторно накладывается на ту же цель в начале следующего раунда. Ранг навыка для повторно наложенного заклинания повышается до уровня знатока.\n%spell2.name: в начале следующего раунда к отряду, призванному этим заклинанием, добавляются еще 4 элементаля."
[A_Clarity_Ability H7HeroAbility]
mName="Ясность"
mTooltip="Применив заклинание изначальной магии, герой получает второй ход в текущем раунде. Во время дополнительного хода герой получает %buff.buff.stat2 к %ICON_MAGIC магии."
[A_Clarity_Buff H7BaseBuff]
mName="Ясность"
[A_ArcanePower_Ability H7HeroAbility]
mName="Чародейская мощь"
mTooltip="Магия и дух героя увеличены на 1 ед."
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="Знание изнач. магии I"
mTooltip="Заклинания "Фортуна" и "Управление временем" накладывются на все отряды в области 4x4."
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="Знание изнач. магии II"
mTooltip="Улучшает заклинание "Мгновенное перемещение": перемещенный отряд получает +50 к инициативе до конца своего следующего хода. Заклинание "Рассеивание магии" накладывается на все отряды в области 3x3."
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="Знание изнач. магии III"
mTooltip="Заклинание "Взрыв" повторно накладывается на ту же цель в начале следующего раунда, нанося половину урона. Заклинание "Призыв элементалей" добавляет к численности изначально призванного отряда ещё половину в начале следующего раунда."
[A_LingeringEnergy_Ability H7HeroAbility]
mName="Длительное восполнение"
mTooltip="После кажой битвы герой получает 20 ед. маны. Не может превышать максимальный запас маны героя."
[A_MagicRipple_Ability H7HeroAbility]
mName="Магическая рябь"
mTooltip="Заклинание "Взрыв" повторно накладывается на ту же цель в начале следующего раунда, нанося половину урона. Заклинание "Призыв элементалей" добавляет к численности изначально призванного отряда ещё половину в начале следующего раунда."
[A_ManaBloom_Ability H7HeroAbility]
mName="Приток маны"
mTooltip="Ежедневно герой восстанавливает вдвое больше маны.\nГерой восстанавливает ману, потраченную на применение первого заклинания за день."
[A_ManaBloom_Buff H7BaseBuff]
mName="Приток маны"
[A_MassDispelMagic_Ability H7HeroAbility]
mName="Рассеивание магии (общее)"
mTooltip="Заклинание "Рассеивание магии" накладывается на все отряды в области 4x4."
[A_MassFortune_Ability H7HeroAbility]
mName="Фортуна (общее)"
mTooltip="Заклинание "Фортуна" накладывается на все дружественные отряды в области 4x4."
[A_MassTimeControl_Ability H7HeroAbility]
mName="Управление временем (общее)"
mTooltip="Заклинание "Управление временем" накладывается на все отряды в области 4x4."
[A_TimeJump_Ability H7HeroAbility]
mName="Временной прыжок"
mTooltip="Заклинание "Мгновенное перемещение" позволяет выбранному отряду сделать ход первым по текущей шкале инициативе. Если перемещённый отряд уже сделал свой ход, то он будет помещён в начало шкалы инициативы в следующем раунде."

UCP 1.1

[A_MasterOfPrime_II_Ability H7HeroAbility]
mName="Знание изнач. магии II"
mTooltip="%spell1.name: теперь заклинание дополнительно увеличивает %spell1.spell.buff1.buff.stat.icon инициативу выбранного отряда на %spell1.spell.buff1.buff.stat.norm. Длительность (ходов): %spell1.spell.buff1.buff.durini.\n%spell2.name: теперь заклинание можно накладывать на отряды в выбранной области 3x3."

UCP 1.2

[A_Renewal_Ability H7HeroAbility]
mName="Обновление"
mTooltip="После боя герой восполняет %stat1.norm ед. %stat1.icon маны."